; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	image7 - mode
	spectrograph4 - mode
	thermograph6 - mode
	spectrograph3 - mode
	infrared2 - mode
	spectrograph5 - mode
	infrared0 - mode
	thermograph1 - mode
	Star1 - direction
	Star0 - direction
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph6)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 image7)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph6)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 infrared2)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph5)
	(calibration_target instrument6 Star2)
	(supports instrument7 image7)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(have_image Star5 spectrograph5)
	(have_image Star5 spectrograph3)
	(have_image Star6 spectrograph3)
	(have_image Star7 infrared2)
	(have_image Star7 infrared0)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon8 spectrograph5)
	(have_image Star9 spectrograph4)
	(have_image Planet10 spectrograph5)
))

)

; plan
1. (turn_to satellite3 star2 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star2)
   goals met: 0 of 9
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite3 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite3 phenomenon8 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon8)
   goals met: 0 of 9
5. (turn_to satellite1 star3 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star3)
   goals met: 0 of 9
6. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 0 of 9
7. (take_image satellite3 phenomenon8 instrument6 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 1 of 9
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
10. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 9
11. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 9
12. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 1 of 9
13. (take_image satellite0 star5 instrument0 spectrograph3)
   added: (have_image star5 spectrograph3)
   goals met: 2 of 9
14. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 2 of 9
15. (take_image satellite0 star6 instrument0 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 3 of 9
16. (turn_to satellite1 phenomenon8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 9
17. (take_image satellite1 phenomenon8 instrument3 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 4 of 9
18. (turn_to satellite1 star7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star7)
   goals met: 4 of 9
19. (take_image satellite1 star7 instrument3 infrared0)
   added: (have_image star7 infrared0)
   goals met: 5 of 9
20. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 5 of 9
21. (take_image satellite1 star9 instrument3 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 6 of 9
22. (turn_to satellite3 planet10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 planet10)
   goals met: 6 of 9
23. (take_image satellite3 planet10 instrument6 spectrograph5)
   added: (have_image planet10 spectrograph5)
   goals met: 7 of 9
24. (turn_to satellite3 star5 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star5)
   goals met: 7 of 9
25. (take_image satellite3 star5 instrument6 spectrograph5)
   added: (have_image star5 spectrograph5)
   goals met: 8 of 9
26. (turn_to satellite3 star7 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star7)
   goals met: 8 of 9
27. (take_image satellite3 star7 instrument6 infrared2)
   added: (have_image star7 infrared2)
   goals met: 9 of 9
